In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.24.2'

In [3]:
ser = pd.Series(['张三','李四','王五'])
ser

0    张三
1    李四
2    王五
dtype: object

In [4]:
ser = pd.Series(['张三','李四','王五'],index=list(range(1,4)))
ser

1    张三
2    李四
3    王五
dtype: object

In [5]:
ser[2]

'李四'

In [6]:
ser[2] = 'Jack'

In [7]:
ind = [1,3]
ser[ind]

1    张三
3    王五
dtype: object

In [8]:
type(ser)

pandas.core.series.Series

In [9]:
ser.values

array(['张三', 'Jack', '王五'], dtype=object)

In [10]:
type(ser.values)

numpy.ndarray

In [11]:
ser2 = pd.Series([22,34,21],index=range(1,4))

In [12]:
ser2

1    22
2    34
3    21
dtype: int64

In [13]:
ser2 + 1

1    23
2    35
3    22
dtype: int64

In [16]:
ser2 % 2 == 0

1     True
2     True
3    False
dtype: bool

In [15]:
ser2[ser2 % 2 == 0]

1    22
2    34
dtype: int64

In [17]:
data = {'beijing':9240,'shanghai':8960,'guangzhou':7400}

In [18]:
ser3 = pd.Series(data)  #字典构建key变为索引

In [19]:
ser3

beijing      9240
shanghai     8960
guangzhou    7400
dtype: int64

In [20]:
ser3['beijing']

9240

In [21]:
'shanghai' in ser3

True

In [22]:
ser4 = pd.Series(data,index=['shanghai','beijing','chongqin'])

In [23]:
ser4  # NaN = not a number

shanghai    8960.0
beijing     9240.0
chongqin       NaN
dtype: float64

In [24]:
ser4.to_dict()

{'shanghai': 8960.0, 'beijing': 9240.0, 'chongqin': nan}

In [25]:
ser4.tolist()

[8960.0, 9240.0, nan]

In [27]:
ser4.to_json()

'{"shanghai":8960.0,"beijing":9240.0,"chongqin":null}'

In [28]:
ser4.to_frame()

               0
shanghai  8960.0
beijing   9240.0
chongqin     NaN

# dataframe

In [31]:
import numpy as np
data = np.arange(100,109).reshape(3,-1)

In [32]:
df = pd.DataFrame(data)

In [33]:
df

     0    1    2
0  100  101  102
1  103  104  105
2  106  107  108

In [34]:
data = {
    'name':['jack','marry','lily'],
    'age':[19,19,17],
    'height':[1.68,1.37,1.62]
}
df = pd.DataFrame(data)
df

    name  age  height
0   jack   19    1.68
1  marry   19    1.37
2   lily   17    1.62

In [35]:
df.columns

Index(['name', 'age', 'height'], dtype='object')

In [36]:
df.columns = ['username','age','height']

In [37]:
df

  username  age  height
0     jack   19    1.68
1    marry   19    1.37
2     lily   17    1.62

In [38]:
df = pd.DataFrame(data,columns=['name','age','height','email'])

In [39]:
df

    name  age  height email
0   jack   19    1.68   NaN
1  marry   19    1.37   NaN
2   lily   17    1.62   NaN

In [41]:
df = pd.DataFrame(data,index=range(1,4),columns=['name','age','height','email'])

In [42]:
df

    name  age  height email
1   jack   19    1.68   NaN
2  marry   19    1.37   NaN
3   lily   17    1.62   NaN